Revit 2027 API
FilterNumericValueRule.SetEvaluator Method
 Sets the evaluator that implements the test for this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEvaluator(
	FilterNumericRuleEvaluator evaluator
)
Public Sub SetEvaluator (
	evaluator As FilterNumericRuleEvaluator
)
public:
void SetEvaluator(
	FilterNumericRuleEvaluator^ evaluator
)
member SetEvaluator :
        evaluator : FilterNumericRuleEvaluator -> unit
Parameters
evaluator FilterNumericRuleEvaluator
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterNumericValueRule Class
Autodesk.Revit.DB Namespace